Model: "functional_119"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_60 (InputLayer)           [(None, 128)]        0                                            
__________________________________________________________________________________________________
embedding_59 (Embedding)        (None, 128, 32)      160000      input_60[0][0]                   
__________________________________________________________________________________________________
lstm_59 (LSTM)                  (None, 128, 100)     53200       embedding_59[0][0]               
__________________________________________________________________________________________________
dropout_59 (Dropout)            (None, 128, 100)     0           lstm_59[0][0]                    
__________________________________________________________________________________________________
dense_118 (Dense)               (None, 128, 1)       101         dropout_59[0][0]                 
__________________________________________________________________________________________________
flatten_59 (Flatten)            (None, 128)          0           dense_118[0][0]                  
__________________________________________________________________________________________________
activation_59 (Activation)      (None, 128)          0           flatten_59[0][0]                 
__________________________________________________________________________________________________
repeat_vector_59 (RepeatVector) (None, 100, 128)     0           activation_59[0][0]              
__________________________________________________________________________________________________
permute_59 (Permute)            (None, 128, 100)     0           repeat_vector_59[0][0]           
__________________________________________________________________________________________________
concatenate_59 (Concatenate)    (None, 128, 200)     0           dropout_59[0][0]                 
                                                                 permute_59[0][0]                 
__________________________________________________________________________________________________
lambda_59 (Lambda)              (None, 200)          0           concatenate_59[0][0]             
__________________________________________________________________________________________________
dense_119 (Dense)               (None, 1)            201         lambda_59[0][0]                  
==================================================================================================
Total params: 213,502
Trainable params: 213,502
Non-trainable params: 0
__________________________________________________________________________________________________
